Tekla.Structures.Model.Operations.Operation.HighlightFunctionalityEnum
Enumeration about what dotHighlightFunctionalityEnum do in TS size

Tekla.Structures.Model.Operations.Operation.HighlightFunctionalityEnum.NEW_HIGHLIGHT
New highlight

Tekla.Structures.Model.Operations.Operation.HighlightFunctionalityEnum.ADD_TO_PREVIOUS_HIGHLIGHT
Add to previous

Tekla.Structures.Model.Operations.Operation.HighlightFunctionalityEnum.HIGHLIGHT_FINISHED
Highlight finished